Description: Download recipe for Bitwarden Desktop x64.
# based upon: https://github.com/autopkg/NickETH-recipes/blob/master/Bitwarden/Bitwarden-Desktop-Win64.download.recipe.yaml
Identifier: com.github.eliyasmeth.download.Bitwarden-DesktopWin64
MinimumVersion: 1.3.1

Input:
  NAME: Bitwarden-Desktop
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    #Bitwarden-Installer-2024.5.0.exe
    asset_regex: Bitwarden-Installer-([0-9]+\.)*[0-9]+\.exe
    github_repo: bitwarden/clients

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%PLATFORM%.exe'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False