
Description: Downloads Bitdefender Antivirus for Windows.
Identifier: com.github.eliyasmeth.download.Bitdefender-Antivirus-Win
MinimumVersion: 1.3.1

Input:
  NAME: Bitdefender Antivirus
  DOWNLOAD_URL: https://www.bitdefender.com/solutions/free/thank-you.html

Process:
- Processor: URLDownloader
  Arguments:
    filename: bitdefender_avfree.exe
    url: '%DOWNLOAD_URL%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False