Description: Downloads NordPass for Windows.
Identifier: com.github.eliyasmeth.download.NordPass-Win
MinimumVersion: 1.3.1

Input:
  NAME: NordPass
  DOWNLOAD_URL: https://downloads.npass.app/windows/NordPassSetup.exe

Process:
- Processor: URLDownloader
  Arguments:
    filename: NordPassSetup.exe
    url: '%DOWNLOAD_URL%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False