Description: Downloads 1Password for Windows.
Identifier: com.github.eliyasmeth.download.1Password-Win
MinimumVersion: 1.3.1

Input:
  NAME: 1Password
  DOWNLOAD_URL: https://downloads.1password.com/win/1PasswordSetup-latest.exe

Process:
- Processor: URLDownloader
  Arguments:
    filename: 1PasswordSetup-latest.exe
    url: '%DOWNLOAD_URL%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False